/**
A, B 두 사람이 가위바위보 게임을 합니다. 총 N번의 게임을 하여 A가 이기면 A를 출력하고, B가 이기면 B를 출력합니다. 비길 경우에는 D를 출력합니다.
가위, 바위, 보의 정보는 1:가위, 2:바위, 3:보로 정하겠습니다.
예를 들어 N=5이면
첫 번째 줄에 게임 횟수인 자연수 N(1<=N<=100)이 주어집니다. 두 번째 줄에는 A가 낸 가위, 바위, 보 정보가 N개 주어집니다. 세 번째 줄에는 B가 낸 가위, 바위, 보 정보가 N개 주어집니다.

23313 11223
 
output: ABABD
*/



const rockPepper=(a,b)=>{
    let answer =[];
    a - 가위 > 바위{
        a
    }else{
        b
    }

    가위 바위
    가위 보
    바위 보 
    
        if( a || b === 1 && a||b===2){
            return a
        }
        if(a)
    
    
    1 -가위 
    2- 바위
    3- 보 

    return answer;
}

console.log(rockPepper([2,3,3,1,3],[1,1,2,2,3]))